/*******************************************************/
/*            Лабораторна  робота №2                   */
/*         Типи даних і введення-виведення             */
/*        Приклад виконання. Варіант № 30              */
/*******************************************************/
#include <stdio.h>
int main(void) {
	char name1[9], name2[9], name3[9];
	char sc1, sc2, sc3;
	unsigned short cnt1, cnt2, cnt3;
	float sq1, sq2, sq3;
	/* Введення фактичних даних */
	printf("1. Введіть: назву, школу, кількість, площу >");
	scanf("%s %c %d %f", name1, &sc1, &cnt1, &sq1);
	printf("2. Введіть: назву, школу, кількість, площу >");
	scanf("%s %c %d %f", name2, &sc2, &cnt2, &sq2);
	printf("3. Введіть: назву, школу, кількість, площу >");
	scanf("%s %c %d %f", name3, &sc3, &cnt3, &sq3);
	/* Виведення таблиці */ /* Виведення заголовків */

	printf("----------------------------------------------\n");
	printf("|Буддійські монастирі Японії періоду Нара    |\n");
	printf("|--------------------------------------------|\n");
	printf("|   Назва  | Школа | Кількість |Площа земель |\n");
	printf("|          |       |  ченців   |    (га)     |\n");
	printf("|----------|-------|-----------|-------------|\n");
	/* виведення рядків фактичних даних */
	printf("| %9s | %c | %3d | %-5.1f |\n", name1, sc1, cnt1, sq1);
	printf("| %9s | %c | %3d | %-5.1f |\n", name2, sc2, cnt2, sq2);
	printf("| %9s | %c | %3d | %-5.1f |\n", name3, sc3, cnt3, sq3);
	/* виведення приміток */
	printf("|--------------------------------------------|\n");
	printf("|Примітка: Т - Тендай; С - Сингон;           |\n");
	printf("|             Д - Дзедзіцу                   |\n");
	printf("----------------------------------------------\n");
	return 0;
}
